{
    "The Ramones": "You listen to a lot of The Ramones. Maybe consider taking a shower.",
    "Tame Impala": "Your top artist is Tame Impala. How much have you spent on Starbucks this year?",
    "Taylor Swift": "Swiftie alert! Are you okay after that breakup?",
    "Drake": "Drake is your top artist. Feeling emotional or just vibing?",
    "Beyoncé": "You're listening to Queen B. Keep slaying!",
    "Eminem": "Eminem? Are you reliving 2000s nostalgia or spitting bars in the mirror?",
    "Metallica": "Metallica? Rock on, but don't forget your earplugs.",
    "Adele": "Adele is your go-to. Let it all out, you're safe here.",
    "Kanye West": "Kanye? Genius or chaos? Either way, you're in for a ride.",
    "Billie Eilish": "Billie Eilish? You're either deep or just vibing in oversized hoodies.",
    "Elton John": "Rocketman? You've got good taste, my friend.",
    "Coldplay": "Coldplay? Do you cry during sunsets too?",
    "Rihanna": "Rihanna? When is that album dropping though?",
    "Led Zeppelin": "Stairway to Heaven? Classic. You're a music connoisseur.",
    "Justin Bieber": "Belieber alert! Never say never, right?",
    "Ed Sheeran": "Ed Sheeran? You're either in love or heartbroken. Maybe both.",
    "Imagine Dragons": "Imagine Dragons? You might be addicted to motivational anthems.",
    "Queen": "Queen fan? We will rock you!",
    "Lady Gaga": "Little monster? You're born this way, baby!",
    "Post Malone": "Post Malone? Cheers to vibing with a cold one.",
    "The Beatles": "Beatles fan? You're either nostalgic or just really classy.",
    "Nirvana": "Smells like teen spirit? Edgy.",
    "Arctic Monkeys": "Arctic Monkeys? Do I Wanna Know how cool you are?",
    "Lana Del Rey": "Lana Del Rey? Forever lost in a summer haze.",
    "Bruno Mars": "Bruno Mars? You're probably the life of the party.",
    "Pink Floyd": "Pink Floyd? Welcome to the dark side of the moon.",
    "Doja Cat": "Doja Cat? You're keeping up with TikTok trends.",
    "The Weeknd": "The Weeknd? Late-night vibes for sure.",
    "Cardi B": "Cardi B? Okurrrr!",
    "Kendrick Lamar": "Kendrick? You're probably into meaningful lyrics.",
    "Fleetwood Mac": "Fleetwood Mac? Dreams and drama.",
    "Frank Ocean": "Frank Ocean? Mysterious and soulful, just like you.",
    "Radiohead": "Radiohead? Existential crisis much?",
    "The Smiths": "The Smiths? Charming and a little melancholic.",
    "The Cure": "The Cure? You must love rainy days.",
    "Arcade Fire": "Arcade Fire? Grandiose indie vibes incoming.",
    "Modest Mouse": "Modest Mouse? Float on, my introspective friend.",
    "Bon Iver": "Bon Iver? Alone in a cabin, are we?",
    "Wilco": "Wilco? You probably have a vinyl collection.",
    "Sufjan Stevens": "Sufjan Stevens? Let me guess, you're journaling about life.",
    "The National": "The National? You love a baritone voice and heartbreak.",
    "Sigur Rós": "Sigur Rós? Are you contemplating life in a snowstorm?",
    "My Bloody Valentine": "My Bloody Valentine? Shoegaze, but make it poetic.",
    "Death Cab for Cutie": "Death Cab for Cutie? You're all about emotional road trips.",
    "Muse": "Muse? Theatrical, dramatic, and definitely a sci-fi fan.",
    "Foals": "Foals? You love a good dance-rock beat.",
    "Interpol": "Interpol? Dark suits and even darker vibes.",
    "Portishead": "Portishead? Trip-hop for your late-night pondering.",
    "Florence + The Machine": "Florence + The Machine? You're chasing the cosmic winds.",
    "Grizzly Bear": "Grizzly Bear? Layered and cerebral, just like you.",
    "Beck": "Beck? Versatility is your middle name.",
    "Pixies": "Pixies? Where is your mind right now?",
    "Joy Division": "Joy Division? Brooding, mysterious, and iconic.",
    "Blur": "Blur? Britpop nostalgia at its finest.",
    "Oasis": "Oasis? Don't look back in anger, my friend.",
    "The Velvet Underground": "The Velvet Underground? You're an art rock aficionado.",
    "R.E.M.": "R.E.M.? Losing your religion or just finding your groove?",
    "Yeah Yeah Yeahs": "Yeah Yeah Yeahs? Art punk with a touch of glamour.",
    "MGMT": "MGMT? You're living in an electric feel.",
    "In Flames": "In Flames? You're either a die-hard metalhead or just here for the melodic riffs.",
    "Slipknot": "Slipknot? Do you own a mask collection, or just a lot of black T-shirts?",
    "Pantera": "Pantera? Walk! Are you crushing it at the gym or in your living room?",
    "Iron Maiden": "Iron Maiden? You've probably got Eddie tattooed somewhere.",
    "Black Sabbath": "Black Sabbath? Bow down to the godfathers of heavy metal!",
    "Slayer": "Slayer? Brutal riffs, brutal taste.",
    "Megadeth": "Megadeth? Are you shredding air guitar right now?",
    "Judas Priest": "Judas Priest? You've got another thing comin' — more metal in your playlist!",
    "Dio": "Dio? Epic vocals and epic taste.",
    "Nightwish": "Nightwish? You're into symphonic metal and epic storytelling.",
    "Rammstein": "Rammstein? German lessons are paying off, huh?",
    "Scooter": "Scooter? How much is the fish? The rave is alive!",
    "Daft Punk": "Daft Punk? Do you dream of robots in discos?",
    "Calvin Harris": "Calvin Harris? You've got the club hits covered.",
    "Deadmau5": "Deadmau5? You're either a gamer or live for the drops.",
    "David Guetta": "David Guetta? Dance floors and festivals are your vibe.",
    "Tiesto": "Tiesto? Pure euphoria and a glowstick in hand.",
    "Madonna": "Madonna? A pop icon for the ages. Vogue it up!",
    "Kylie Minogue": "Kylie Minogue? Disco grooves and good vibes all around.",
    "Britney Spears": "Britney Spears? It's not a phase; you're just pop royalty.",
    "Cher": "Cher? If you could turn back time, you'd still pick Cher.",
    "ABBA": "ABBA? Dancing Queen is your anthem, admit it.",
    "Cyndi Lauper": "Cyndi Lauper? Time after time, you're a true 80s fan.",
    "Depeche Mode": "Depeche Mode? Synths, darkness, and you in the corner.",
    "The Prodigy": "The Prodigy? Firestarter energy all day long.",
    "Pet Shop Boys": "Pet Shop Boys? West End Girl meets disco classics.",
    "The Chemical Brothers": "The Chemical Brothers? Big beats are your thing.",
    "Boney M.": "Boney M.? You're the life of every retro party.",
    "New Order": "New Order? Synthpop nostalgia in full swing.",
    "Fatboy Slim": "Fatboy Slim? Praise you for your excellent taste in beats.",
    "Armin van Buuren": "Armin van Buuren? Trance king, party god.",
    "Above & Beyond": "Above & Beyond? You're a deep-feels kind of raver.",
    "Ariana Grande": "Ariana Grande? Big voice, even bigger vibes.",
    "Donna Summer": "Donna Summer? Disco never dies, and neither does your groove.",
    "Whitney Houston": "Whitney Houston? You're hitting those high notes — or trying to!",
    "HIM": "HIM? You’re all about love metal and gothic vibes.",
    "Apocalyptica": "Apocalyptica? Metallica on cellos is your jam.",
    "The Rasmus": "The Rasmus? Black feathers and emo nostalgia.",
    "Blind Channel": "Blind Channel? EuroVision glory meets rebellious rock.",
    "Cheek": "Cheek? Finnish rap royalty. Respect.",
    "JVG": "JVG? Every summer anthem in Finland is basically theirs.",
    "Isac Elliot": "Isac Elliot? The Finnish Bieber, but cooler.",
    "Kaija Koo": "Kaija Koo? Pure Finnish pop perfection.",
    "Antti Tuisku": "Antti Tuisku? You’re ‘playing’ with the best in Finnish pop.",
    "Eppu Normaali": "Eppu Normaali? The soundtrack of every Finnish road trip.",
    "Juice Leskinen": "Juice Leskinen? You’re into poetic lyrics and Finnish classics.",
    "Frank Sinatra": "Frank Sinatra? You’ve got old-school class and a taste for timeless tunes.",
    "Dean Martin": "Dean Martin? A crooner with charm, much like you.",
    "Elvis Presley": "Elvis Presley? The King of Rock 'n' Roll and your heart.",
    "Nat King Cole": "Nat King Cole? Smooth and soulful, just like your vibe.",
    "Ray Charles": "Ray Charles? You’re all about the classics with soul.",
    "J. Cole": "J. Cole? Thoughtful bars and deep vibes are your thing.",
    "Lil Nas X": "Lil Nas X? Genre-bending and unapologetically bold.",
    "Travis Scott": "Travis Scott? AstroWorld vibes all day.",
    "Ice Spice": "Ice Spice? Munching on beats and trending on TikTok.",
    "Olivia Rodrigo": "Olivia Rodrigo? Teenage angst, but make it iconic.",
    "Harry Styles": "Harry Styles? Gender-fluid fashion and catchy tunes define your vibe.",
    "BTS": "BTS? You’re part of the ARMY, and it’s a full-time job.",
    "Bad Bunny": "Bad Bunny? Reggaeton vibes and global domination.",
    "Karol G": "Karol G? Latin beats and empowering lyrics are your thing.",
    "Morgan Wallen": "Morgan Wallen? A little bit country, a lot of catchy tunes.",
    "Lizzo": "Lizzo? Body positivity and bangers, all day long.",
    "Måneskin": "Måneskin? Italian glam rock for the modern era.",
    "SZA": "SZA? Chill R&B with emotional depth is your vibe."
}