{
    "Rock": "Rock? Classic riffs and head-banging moments for days.",
    "Pop": "Pop? You’re into catchy hooks and chart-topping bangers.",
    "Hip-Hop": "Hip-Hop? Bars, beats, and swagger define your playlist.",
    "Jazz": "Jazz? You’ve got a soul that appreciates improvisation and cool vibes.",
    "Classical": "Classical? You’re all about sophistication and timeless masterpieces.",
    "Electronic": "Electronic? You’re chasing beats that make your heart race.",
    "EDM": "EDM? Festivals, glow sticks, and late-night dance sessions.",
    "Metal": "Metal? Headbanging and shredding guitars are your life.",
    "Symphonic Metal": "Symphonic Metal? Heavy riffs meet orchestral elegance.",
    "Blues": "Blues? You’re feeling emotions that go way back.",
    "Reggae": "Reggae? You’re all about chill vibes and good times.",
    "Country": "Country? A little twang and a lot of storytelling.",
    "R&B": "R&B? Smooth grooves and soulful vocals fill your world.",
    "Soul": "Soul? You’re all about heart and feeling in every note.",
    "Indie": "Indie? You’re too cool for the mainstream but love a good vibe.",
    "Punk": "Punk? Loud, fast, and unapologetically rebellious.",
    "Folk": "Folk? Acoustic guitars and heartfelt stories are your jam.",
    "Dance": "Dance? You’re here to move, groove, and repeat.",
    "Disco": "Disco? Glitter, glam, and boogie nights are your thing.",
    "Alternative": "Alternative? You love creative sounds and non-conformity.",
    "K-Pop": "K-Pop? Perfect choreography and addictive tracks define your vibe.",
    "Latin": "Latin? Rhythmic beats and passionate vibes are your life.",
    "Trap": "Trap? Heavy bass, fast hi-hats, and hype energy.",
    "Lo-Fi": "Lo-Fi? Chill beats to relax or study to.",
    "Techno": "Techno? The underground beats never stop for you.",
    "House": "House? Smooth rhythms and endless dance parties.",
    "Dubstep": "Dubstep? Wub-wub-wub is your ultimate soundtrack.",
    "Ambient": "Ambient? You’re into atmospheric vibes and sonic escapism.",
    "New Age": "New Age? Meditation, zen, and otherworldly sounds.",
    "Hard Rock": "Hard Rock? Loud guitars and unapologetic energy define your style.",
    "Grunge": "Grunge? Flannel shirts and introspective angst all day long.",
    "Progressive Rock": "Progressive Rock? You love complex time signatures and epic solos.",
    "Gospel": "Gospel? Spiritual uplift and vocal excellence fill your playlist.",
    "Opera": "Opera? Dramatic, powerful, and undeniably elegant.",
    "Ska": "Ska? Upbeat tempos and brass sections make you smile.",
    "World Music": "World Music? You’re a global citizen with diverse tastes."
  }